In [5]:
import pandas as pd
import numpy as np

### **1 - En primer lugar tenemos que leer la base de datos**

En nuestro caso es un csv y usaremos el método de pandas:
```Python
pd.read_csv("Aquí escribiremos donde está el archivo")
```

In [12]:
df = pd.read_csv('data\ds_salaries.csv') #generalmente guardamos la base de datos en una variable df (dataframe)
type(df)

pandas.core.frame.DataFrame

Para comprobar que se ha cargado bien la base de datos con el método ".head" mostraremos las filas que introduzcamos en el paréntesis

In [7]:
df.head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

Al invocar las 3 primeras filas no es necesario que introduzcamos las letras __'pd'__ ya que estamos trabajando **sobre un data frame** y head() es un método propio de un objeto __dataframe__

###### Diferencia entre funciones y métodos en pandas:
- **Funciones de la librería (pd como prefijo)**: Cuando utilizas pandas, algunas funcionalidades son funciones globales que requieren usar el prefijo pd para invocarlas, como en el caso de pd.read_csv(). Esto se debe a que read_csv() es una función de pandas, y no es parte del DataFrame o Series. Necesitas usar pd para acceder a ella, ya que estás llamando a una función que está en el espacio de nombres de la librería pandas.
    ``` Python
    df = pd.read_csv('data\ds_salaries.csv')
    ```
- **Métodos del objeto DataFrame o Series**: En cambio, head() es un método de un objeto DataFrame o Series. Cuando creas un DataFrame al leer un archivo con pd.read_csv(), el objeto df se convierte en una instancia de la clase DataFrame, y dicha clase tiene métodos como head(), tail(), describe(), etc.

Como estos métodos pertenecen a la clase DataFrame, puedes llamarlos directamente sobre la instancia (df en este caso), sin necesidad de usar el prefijo pd.

In [13]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [17]:
df.shape #saber las dimensiones

(3755, 11)

In [19]:
df.dtypes #saber los tipos de datos

#siempre que veamos un objeto en un dtype es un string

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

Ahora sabemos los encabezados, las dimensaiones de la DB y los tipos de datos

### 2 - **Saber que datos nulos tenemos aquí dentro:**

Para eso usaremos 
```Python 
df.isnull().sum() 
```
para saber la cantidad de dartos nulos que tenemos en cada columna

Los valores nulos se muestran como ***"NaN"*** que es una abreviatura de ***"Not a Number"***


Más adelante podremos usar algoritmos de vecinos kNN para arreglar estos valores solos, en resumen kNN nos vale para establecer grupos de vecinos, es un algortimo muy útil.

In [20]:
df.isnull().sum() #saber cuantos datos nulos hay en cada columnas

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

### **3 - Revisar valores duplicados y eliminarlos o no**

Se eliminan o se mantienen a juicio del analista.

La funcion nos dirá las filas que se repiten todos los parámetros.

Se realiza con la línea:
```Python
df.duplicated().sum()
```
##### ***Sintaxis de __.duplicated()__
```Python
DataFrame.duplicated(subset=None, keep='first')
```
- **subset (opcional)**: Especifica las columnas que deben considerarse al buscar duplicados. Si no se proporciona, se consideran todas las columnas del DataFrame.Si quieres buscar duplicados basándote solo en algunas columnas, puedes pasar una lista de nombres de columnas.
- **keep (opcional)**: Determina qué duplicado(s) marcar como True (es decir, identificar como duplicado).
        'first' (predeterminado): Marca todas las ocurrencias como duplicadas excepto la primera.
        'last': Marca todas las ocurrencias como duplicadas excepto la última.
        False: Marca todas las ocurrencias de duplicados como duplicadas (incluyendo la primera).

In [22]:
df.duplicated().sum() # saber los valores duplicados

1171

Crear función para saber la cantidad de filas repetidas que tenemos ya que esta información tampoco nos va a ser muy útil.

In [27]:
duplicados=pd.DataFrame(df.value_counts())
duplicados[duplicados['count']>1]

                                                                                                                                                                    count
work_year experience_level employment_type job_title            salary salary_currency salary_in_usd employee_residence remote_ratio company_location company_size
2022      SE               FT              Data Scientist       191475 USD             191475        US                 100          US               M                21
                                                                141525 USD             141525        US                 100          US               M                21
2023      SE               FT              Data Engineer        252000 USD             252000        US                 0            US               M                13
                                                                129000 USD             129000        US                 0            US               M                13
2022      SE               FT              Data Engineer        130000 USD             130000        US                 0            US               M                12
...                                                                                                                                                                   ...
                                           Data Scientist       119300 USD             119300        US                 0            US               L                 2
2023      SE               FT              Data Quality Analyst 100000 USD             100000        US                 0            US               M                 2
                                                                80000  USD             80000         US                 0            US               M                 2
2022      EN               FT              Data Analyst         50000  USD             50000         US                 50           US               L                 2
2023      MI               FT              Data Analyst         85000  USD             85000         US                 0            US               M                 2

[544 rows x 1 columns]

In [29]:
#Eliminamos las filas duplicadas
df.drop_duplicates(inplace=True)
df.duplicated().sum()

0

#### PRE-PROCESAMIENTO

#### EDA (Exploratory Data Analisys)

In [30]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

Una parte muy importante si no te dan ningún objetivo tenemos que hacernos preguntas importantes sobre los datos.
- En que país se cobra más 
- Que compañía paga más
- etc.

Pregunta: ¿En que puesto se cobra más?

Pregunta: País de residencia donde se cobra más

Pregunta: por que porcentage promedio se aumenta el salario entre nivel de experiencia

Pregunta: en que pais se cobra  mas por tipo de empleo?

Pregunta: ¿El nivel de  experiencia es proporcional al salario

Pregunta: nivel de expriencia mas requerido